sterentev/atdf-device-asm-include/inc/ATmega64RFR2.inc
; ----------	Register ASSR bits		------------------------
.equ	EXCLKAMR	= 7		; 0x80 - Enable External Clock Input for AMR
.equ	EXCLK		= 6		; 0x40 - Enable External Clock Input
.equ	AS2		= 5		; 0x20 - Timer/Counter2 Asynchronous Mode
.equ	TCN2UB		= 4		; 0x10 - Timer/Counter2 Update Busy
.equ	OCR2AUB		= 3		; 0x08 - Timer/Counter2 Output Compare Register A Update Busy
.equ	OCR2BUB		= 2		; 0x04 - Timer/Counter2 Output Compare Register B Update Busy
.equ	TCR2AUB		= 1		; 0x02 - Timer/Counter2 Control Register A Update Busy
.equ	TCR2BUB		= 0		; 0x01 - Timer/Counter2 Control Register B Update Busy

; ----------	Register GTCCR bits		------------------------
;.equ	TSM		= 7		; 0x80 - Timer/Counter Synchronization Mode
;.equ	PSRASY		= 1		; 0x02 - Prescaler Reset Timer/Counter2



; ====	WDT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register WDTCSR bits		------------------------
.equ	WDIF		= 7		; 0x80 - Watchdog Timeout Interrupt Flag
.equ	WDIE		= 6		; 0x40 - Watchdog Timeout Interrupt Enable
.equ	WDP_MASK	= 0x27		;      - Watchdog Timer Prescaler Bits (4 bits)
.equ	WDCE		= 4		; 0x10 - Watchdog Change Enable
.equ	WDE		= 3		; 0x08 - Watch Dog Enable
; ::::  WDP	:::: bitfield values
;			0x00		; Oscillator Cycles 2K
;			0x01		; Oscillator Cycles 4K
;			0x02		; Oscillator Cycles 8K
;			0x03		; Oscillator Cycles 16K
;			0x04		; Oscillator Cycles 32K
;			0x05		; Oscillator Cycles 64K
;			0x06		; Oscillator Cycles 128K
;			0x07		; Oscillator Cycles 256K
;			0x20		; Oscillator Cycles 512K
;			0x21		; Oscillator Cycles 1024K



; ====	TC16 MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register TCCR5A bits		------------------------
.equ	COM5A_MASK	= 0xC0		;      - Compare Output Mode for Channel A (2 bits)
.equ	COM5A0		= 6		;          COM5A BIT0 position
.equ	COM5B_MASK	= 0x30		;      - Compare Output Mode for Channel B (2 bits)
.equ	COM5B0		= 4		;          COM5B BIT0 position
.equ	COM5C_MASK	= 0x0C		;      - Compare Output Mode for Channel C (2 bits)
.equ	COM5C0		= 2		;          COM5C BIT0 position
.equ	TCCR5A_WGM5_MASK= 0x03		;      - Waveform Generation Mode (2 bits)
.equ	TCCR5A_WGM50	= 0		;          TCCR5A_WGM5 BIT0 position
; ::::  COM5A	:::: bitfield values
;			0x00		; Normal operation
;			0x40		; Reserved
;			0x80		; Reserved
;			0xC0		; Reserved
; ::::  COM5B	:::: bitfield values
;			0x00		; Normal operation
;			0x10		; Reserved
;			0x20		; Reserved
;			0x30		; Reserved
; ::::  COM5C	:::: bitfield values
;			0x00		; Normal operation
;			0x04		; Reserved
;			0x08		; Reserved
;			0x0C		; Reserved
; ::::  TCCR5A_WGM5	>>>> This is a part of TC1_WGMX_BITF enum (see complete values list below)

; ----------	Register TCCR5B bits		------------------------
.equ	ICNC5		= 7		; 0x80 - Input Capture 5 Noise Canceller
.equ	ICES5		= 6		; 0x40 - Input Capture 5 Edge Select
.equ	TCCR5B_WGM5_MASK= 0x18		;      - Waveform Generation Mode (2 bits)
.equ	TCCR5B_WGM50	= 3		;          TCCR5B_WGM5 BIT0 position
.equ	CS5_MASK	= 0x07		;      - Clock Select (3 bits)
.equ	CS50		= 0		;          CS5 BIT0 position
; ::::  TCCR5B_WGM5	>>>> This is a part of TC1_WGMX_BITF enum (see complete values list below)
; ::::  CS5	:::: bitfield values
;			0x00		; No clock source (Timer/Counter stopped)
;			0x01		; clk_IO/1 (no prescaling)
;			0x02		; clk_IO/8 (from prescaler)
;			0x03		; clk_IO/64 (from prescaler)
;			0x04		; clk_IO/256 (from prescaler)
;			0x05		; clk_IO/1024 (from prescaler)
;			0x06		; Reserved
;			0x07		; Reserved

; ----------	Register TCCR5C bits		------------------------
.equ	FOC5A		= 7		; 0x80 - Force Output Compare for Channel A
.equ	FOC5B		= 6		; 0x40 - Force Output Compare for Channel B
.equ	FOC5C		= 5		; 0x20 - Force Output Compare for Channel C

; ----------	Register TIMSK5 bits		------------------------
.equ	ICIE5		= 5		; 0x20 - Timer/Counter5 Input Capture Interrupt Enable
.equ	OCIE5C		= 3		; 0x08 - Timer/Counter5 Output Compare C Match Interrupt Enable
.equ	OCIE5B		= 2		; 0x04 - Timer/Counter5 Output Compare B Match Interrupt Enable
.equ	OCIE5A		= 1		; 0x02 - Timer/Counter5 Output Compare A Match Interrupt Enable
.equ	TOIE5		= 0		; 0x01 - Timer/Counter5 Overflow Interrupt Enable

; ----------	Register TIFR5 bits		------------------------
.equ	ICF5		= 5		; 0x20 - Timer/Counter5 Input Capture Flag
.equ	OCF5C		= 3		; 0x08 - Timer/Counter5 Output Compare C Match Flag
.equ	OCF5B		= 2		; 0x04 - Timer/Counter5 Output Compare B Match Flag
.equ	OCF5A		= 1		; 0x02 - Timer/Counter5 Output Compare A Match Flag
.equ	TOV5		= 0		; 0x01 - Timer/Counter5 Overflow Flag

; ----------	Register TCCR4A bits		------------------------
.equ	COM4A_MASK	= 0xC0		;      - Compare Output Mode for Channel A (2 bits)
.equ	COM4A0		= 6		;          COM4A BIT0 position
.equ	COM4B_MASK	= 0x30		;      - Compare Output Mode for Channel B (2 bits)
.equ	COM4B0		= 4		;          COM4B BIT0 position
.equ	COM4C_MASK	= 0x0C		;      - Compare Output Mode for Channel C (2 bits)
.equ	COM4C0		= 2		;          COM4C BIT0 position
.equ	TCCR4A_WGM4_MASK= 0x03		;      - Waveform Generation Mode (2 bits)
.equ	TCCR4A_WGM40	= 0		;          TCCR4A_WGM4 BIT0 position
; ::::  COM4A	:::: bitfield values
;			0x00		; Normal operation
;			0x40		; Reserved
;			0x80		; Reserved
;			0xC0		; Reserved
; ::::  COM4B	:::: bitfield values
;			0x00		; Normal operation
;			0x10		; Reserved
;			0x20		; Reserved
;			0x30		; Reserved
; ::::  COM4C	:::: bitfield values
;			0x00		; Normal operation
;			0x04		; Reserved
;			0x08		; Reserved
;			0x0C		; Reserved
; ::::  TCCR4A_WGM4	>>>> This is a part of TC1_WGMX_BITF enum (see complete values list below)

; ----------	Register TCCR4B bits		------------------------
.equ	ICNC4		= 7		; 0x80 - Input Capture 4 Noise Canceller
.equ	ICES4		= 6		; 0x40 - Input Capture 4 Edge Select
.equ	TCCR4B_WGM4_MASK= 0x18		;      - Waveform Generation Mode (2 bits)
.equ	TCCR4B_WGM40	= 3		;          TCCR4B_WGM4 BIT0 position
.equ	CS4_MASK	= 0x07		;      - Clock Select (3 bits)
.equ	CS40		= 0		;          CS4 BIT0 position
; ::::  TCCR4B_WGM4	>>>> This is a part of TC1_WGMX_BITF enum (see complete values list below)
; ::::  CS4	:::: bitfield values
;			0x00		; No clock source (Timer/Counter stopped)
;			0x01		; clk_IO/1 (no prescaling)
;			0x02		; clk_IO/8 (from prescaler)
;			0x03		; clk_IO/64 (from prescaler)
;			0x04		; clk_IO/256 (from prescaler)
;			0x05		; clk_IO/1024 (from prescaler)
;			0x06		; Reserved
;			0x07		; Reserved

; ----------	Register TCCR4C bits		------------------------
.equ	FOC4A		= 7		; 0x80 - Force Output Compare for Channel A
.equ	FOC4B		= 6		; 0x40 - Force Output Compare for Channel B
.equ	FOC4C		= 5		; 0x20 - Force Output Compare for Channel C

; ----------	Register TIMSK4 bits		------------------------
.equ	ICIE4		= 5		; 0x20 - Timer/Counter4 Input Capture Interrupt Enable
.equ	OCIE4C		= 3		; 0x08 - Timer/Counter4 Output Compare C Match Interrupt Enable
.equ	OCIE4B		= 2		; 0x04 - Timer/Counter4 Output Compare B Match Interrupt Enable
.equ	OCIE4A		= 1		; 0x02 - Timer/Counter4 Output Compare A Match Interrupt Enable
.equ	TOIE4		= 0		; 0x01 - Timer/Counter4 Overflow Interrupt Enable

