sterentev/atdf-device-asm-include/inc/ATmega64RFR2.inc
; ----------	Register SCCNTHH bits		------------------------
.equ	SCCNTHH_MASK	= 0xFF		;      - Symbol Counter Register HH-Byte (8 bits)
.equ	SCCNTHH0	= 0		;          SCCNTHH BIT0 position

; ----------	Register SCCNTHL bits		------------------------
.equ	SCCNTHL_MASK	= 0xFF		;      - Symbol Counter Register HL-Byte (8 bits)
.equ	SCCNTHL0	= 0		;          SCCNTHL BIT0 position

; ----------	Register SCCNTLH bits		------------------------
.equ	SCCNTLH_MASK	= 0xFF		;      - Symbol Counter Register LH-Byte (8 bits)
.equ	SCCNTLH0	= 0		;          SCCNTLH BIT0 position

; ----------	Register SCCNTLL bits		------------------------
.equ	SCCNTLL_MASK	= 0xFF		;      - Symbol Counter Register LL-Byte (8 bits)
.equ	SCCNTLL0	= 0		;          SCCNTLL BIT0 position

; ----------	Register SCIRQS bits		------------------------
.equ	IRQSBO		= 4		; 0x10 - Backoff Slot Counter IRQ
.equ	IRQSOF		= 3		; 0x08 - Symbol Counter Overflow IRQ
.equ	IRQSCP_MASK	= 0x07		;      - Compare Unit 3 Compare Match IRQ (3 bits)
.equ	IRQSCP0		= 0		;          IRQSCP BIT0 position

; ----------	Register SCIRQM bits		------------------------
.equ	IRQMBO		= 4		; 0x10 - Backoff Slot Counter IRQ enable
.equ	IRQMOF		= 3		; 0x08 - Symbol Counter Overflow IRQ enable
.equ	IRQMCP_MASK	= 0x07		;      - Symbol Counter Compare Match 3 IRQ enable (3 bits)
.equ	IRQMCP0		= 0		;          IRQMCP BIT0 position

; ----------	Register SCSR bits		------------------------
.equ	SCBSY		= 0		; 0x01 - Symbol Counter busy

; ----------	Register SCCR1 bits		------------------------
.equ	Res_MASK	= 0xC0		;      - Reserved Bit (2 bits)
;.equ	Res0		= 6		;          Res BIT0 position
.equ	SCBTSM		= 5		; 0x20 - Symbol Counter Beacon Timestamp Mask Register
.equ	SCCKDIV_MASK	= 0x1C		;      - Clock divider for synchronous clock source (16MHz Transceiver Clock) (3 bits)
.equ	SCCKDIV0	= 2		;          SCCKDIV BIT0 position
.equ	SCEECLK		= 1		; 0x02 - Enable External Clock Source on PG2
.equ	SCENBO		= 0		; 0x01 - Backoff Slot Counter enable
; ::::  SCCKDIV	:::: bitfield values
;			0x00		; Transceiver Clock divided by 256, (62.5kHz)
;			0x04		; Transceiver Clock divided by 128, (125kHz)
;			0x08		; Transceiver Clock divided by 64,  (250kHz)
;			0x0C		; Transceiver Clock divided by 32,  (500kHz)
;			0x10		; Transceiver Clock divided by 16,  (1MHz)
;			0x14		; Transceiver Clock divided by 8,   (2MHz)
;			0x18		; Transceiver Clock divided by 4,   (4MHz)

; ----------	Register SCCR0 bits		------------------------
.equ	SCRES		= 7		; 0x80 - Symbol Counter Synchronization
.equ	SCMBTS		= 6		; 0x40 - Manual Beacon Timestamp
.equ	SCEN		= 5		; 0x20 - Symbol Counter enable
.equ	SCCKSEL		= 4		; 0x10 - Symbol Counter Clock Source select
.equ	SCTSE		= 3		; 0x08 - Symbol Counter Automatic Timestamping enable
.equ	SCCMP_MASK	= 0x07		;      - Symbol Counter Compare Unit 3 Mode select (3 bits)
.equ	SCCMP0		= 0		;          SCCMP BIT0 position

; ----------	Register SCCSR bits		------------------------
.equ	SCCS3_MASK	= 0x30		;      - Symbol Counter Compare Source select register for Compare Unit 3 (2 bits)
.equ	SCCS30		= 4		;          SCCS3 BIT0 position
.equ	SCCS2_MASK	= 0x0C		;      - Symbol Counter Compare Source select register for Compare Unit 2 (2 bits)
.equ	SCCS20		= 2		;          SCCS2 BIT0 position
.equ	SCCS1_MASK	= 0x03		;      - Symbol Counter Compare Source select register for Compare Units (2 bits)
.equ	SCCS10		= 0		;          SCCS1 BIT0 position
; ::::  SCCS3	:::: bitfield values
;			0x00		; Compare Unit 3 Relative Compare Source = Beacon Timestamp Register
;			0x10		; Compare Unit 3 Relative Compare Source = Transmit Frame Timestamp Register
;			0x20		; Compare Unit 3 Relative Compare Source = Received Frame Timestamp Register
; ::::  SCCS2	:::: bitfield values
;			0x00		; Compare Unit 2 Relative Compare Source = Beacon Timestamp Register
;			0x04		; Compare Unit 2 Relative Compare Source = Transmit Frame Timestamp Register
;			0x08		; Compare Unit 2 Relative Compare Source = Received Frame Timestamp Register
; ::::  SCCS1	:::: bitfield values
;			0x00		; Compare Unit 1 Relative Compare Source = Beacon Timestamp Register
;			0x01		; Compare Unit 1 Relative Compare Source = Transmit Frame Timestamp Register
;			0x02		; Compare Unit 1 Relative Compare Source = Received Frame Timestamp Register

; ----------	Register SCRSTRHH bits		------------------------
.equ	SCRSTRHH_MASK	= 0xFF		;      - Symbol Counter Received Frame Timestamp Register HH-Byte (8 bits)
.equ	SCRSTRHH0	= 0		;          SCRSTRHH BIT0 position

; ----------	Register SCRSTRHL bits		------------------------
.equ	SCRSTRHL_MASK	= 0xFF		;      - Symbol Counter Received Frame Timestamp Register HL-Byte (8 bits)
.equ	SCRSTRHL0	= 0		;          SCRSTRHL BIT0 position

; ----------	Register SCRSTRLH bits		------------------------
.equ	SCRSTRLH_MASK	= 0xFF		;      - Symbol Counter Received Frame Timestamp Register LH-Byte (8 bits)
.equ	SCRSTRLH0	= 0		;          SCRSTRLH BIT0 position

; ----------	Register SCRSTRLL bits		------------------------
.equ	SCRSTRLL_MASK	= 0xFF		;      - Symbol Counter Received Frame Timestamp Register LL-Byte (8 bits)
.equ	SCRSTRLL0	= 0		;          SCRSTRLL BIT0 position



; ====	EEPROM MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register EECR bits		------------------------
.equ	EEPM_MASK	= 0x30		;      - EEPROM Programming Mode (2 bits)
.equ	EEPM0		= 4		;          EEPM BIT0 position
.equ	EERIE		= 3		; 0x08 - EEPROM Ready Interrupt Enable
.equ	EEMPE		= 2		; 0x04 - EEPROM Master Write Enable
.equ	EEPE		= 1		; 0x02 - EEPROM Programming Enable
.equ	EERE		= 0		; 0x01 - EEPROM Read Enable
; ::::  EEPM	:::: bitfield values
;			0x00		; Erase and Write in one operation (Atomic Operation)
;			0x10		; Erase only
;			0x20		; Write only
;			0x30		; Reserved for future use



; ====	JTAG MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register OCDR bits		------------------------
.equ	OCDR_MASK	= 0xFF		;      - On-Chip Debug Register Data (8 bits)
.equ	OCDR0		= 0		;          OCDR BIT0 position
; ::::  OCDR	:::: bitfield values
;			0x00		; Refer to the debugger documentation for further information on how to use this register.

; ----------	Register MCUCR bits		------------------------
.equ	JTD		= 7		; 0x80 - JTAG Interface Disable

