sterentev/atdf-device-asm-include/inc/ATmega64RFR2.inc
; ----------	Register MCUSR bits		------------------------
.equ	JTRF		= 4		; 0x10 - JTAG Reset Flag



; ====	EXINT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register EICRA bits		------------------------
.equ	ISC3_MASK	= 0xC0		;      - External Interrupt 3 Sense Control Bit (2 bits)
.equ	ISC30		= 6		;          ISC3 BIT0 position
.equ	ISC2_MASK	= 0x30		;      - External Interrupt 2 Sense Control Bit (2 bits)
.equ	ISC20		= 4		;          ISC2 BIT0 position
.equ	ISC1_MASK	= 0x0C		;      - External Interrupt 1 Sense Control Bit (2 bits)
.equ	ISC10		= 2		;          ISC1 BIT0 position
.equ	ISC0_MASK	= 0x03		;      - External Interrupt 0 Sense Control Bit (2 bits)
.equ	ISC00		= 0		;          ISC0 BIT0 position
; ::::  ISC3	:::: bitfield values
;			0x00		; The low level of INTn generates an interrupt request.
;			0x40		; Any edge of INTn generates asynchronously an interrupt request.
;			0x80		; The falling edge of INTn generates asynchronously an interrupt request.
;			0xC0		; The rising edge of INTn generates asynchronously an interrupt request.
; ::::  ISC2	:::: bitfield values
;			0x00		; The low level of INTn generates an interrupt request.
;			0x10		; Any edge of INTn generates asynchronously an interrupt request.
;			0x20		; The falling edge of INTn generates asynchronously an interrupt request.
;			0x30		; The rising edge of INTn generates asynchronously an interrupt request.
; ::::  ISC1	:::: bitfield values
;			0x00		; The low level of INTn generates an interrupt request.
;			0x04		; Any edge of INTn generates asynchronously an interrupt request.
;			0x08		; The falling edge of INTn generates asynchronously an interrupt request.
;			0x0C		; The rising edge of INTn generates asynchronously an interrupt request.
; ::::  ISC0	:::: bitfield values
;			0x00		; The low level of INTn generates an interrupt request.
;			0x01		; Any edge of INTn generates asynchronously an interrupt request.
;			0x02		; The falling edge of INTn generates asynchronously an interrupt request.
;			0x03		; The rising edge of INTn generates asynchronously an interrupt request.

; ----------	Register EICRB bits		------------------------
.equ	ISC7_MASK	= 0xC0		;      - External Interrupt 7 Sense Control Bit (2 bits)
.equ	ISC70		= 6		;          ISC7 BIT0 position
.equ	ISC6_MASK	= 0x30		;      - External Interrupt 6 Sense Control Bit (2 bits)
.equ	ISC60		= 4		;          ISC6 BIT0 position
.equ	ISC5_MASK	= 0x0C		;      - External Interrupt 5 Sense Control Bit (2 bits)
.equ	ISC50		= 2		;          ISC5 BIT0 position
.equ	ISC4_MASK	= 0x03		;      - External Interrupt 4 Sense Control Bit (2 bits)
.equ	ISC40		= 0		;          ISC4 BIT0 position
; ::::  ISC7	:::: bitfield values
;			0x00		; The low level of INTn generates an interrupt request.
;			0x40		; Any edge of INTn generates asynchronously an interrupt request.
;			0x80		; The falling edge of INTn generates asynchronously an interrupt request.
;			0xC0		; The rising edge of INTn generates asynchronously an interrupt request.
; ::::  ISC6	:::: bitfield values
;			0x00		; The low level of INTn generates an interrupt request.
;			0x10		; Any edge of INTn generates asynchronously an interrupt request.
;			0x20		; The falling edge of INTn generates asynchronously an interrupt request.
;			0x30		; The rising edge of INTn generates asynchronously an interrupt request.
; ::::  ISC5	:::: bitfield values
;			0x00		; The low level of INTn generates an interrupt request.
;			0x04		; Any edge of INTn generates asynchronously an interrupt request.
;			0x08		; The falling edge of INTn generates asynchronously an interrupt request.
;			0x0C		; The rising edge of INTn generates asynchronously an interrupt request.
; ::::  ISC4	:::: bitfield values
;			0x00		; The low level of INTn generates an interrupt request.
;			0x01		; Any edge of INTn generates asynchronously an interrupt request.
;			0x02		; The falling edge of INTn generates asynchronously an interrupt request.
;			0x03		; The rising edge of INTn generates asynchronously an interrupt request.

; ----------	Register EIMSK bits		------------------------
.equ	INT_MASK	= 0xFF		;      - External Interrupt Request Enable (8 bits)
.equ	INT0		= 0		;          INT BIT0 position
; ::::  INT	:::: bitfield values
;			0x00		; All external pin interrupts are disabled.
;			0xFF		; All external pin interrupts are enabled.

; ----------	Register EIFR bits		------------------------
.equ	INTF_MASK	= 0xFF		;      - External Interrupt Flag (8 bits)
.equ	INTF0		= 0		;          INTF BIT0 position
; ::::  INTF	:::: bitfield values
;			0x00		; No edge or logic change on INT7:0 occurred.
;			0x01		; A edge or logic change on INT0 occurred and triggered an interrupt request.
;			0x02		; ...
;			0x80		; A edge or logic change on INT7 occurred and triggered an interrupt request.

; ----------	Register PCMSK2 bits		------------------------
.equ	PCINT_MASK	= 0xFF		;      - Pin Change Enable Mask (8 bits)
.equ	PCINT0		= 0		;          PCINT BIT0 position

; ----------	Register PCMSK1 bits		------------------------
;.equ	PCINT_MASK	= 0xFF		;      - Pin Change Enable Mask (8 bits)
;.equ	PCINT0		= 0		;          PCINT BIT0 position

; ----------	Register PCMSK0 bits		------------------------
;.equ	PCINT_MASK	= 0xFF		;      - Pin Change Enable Mask (8 bits)
;.equ	PCINT0		= 0		;          PCINT BIT0 position

; ----------	Register PCIFR bits		------------------------
.equ	PCIF_MASK	= 0x07		;      - Pin Change Interrupt Flags (3 bits)
.equ	PCIF0		= 0		;          PCIF BIT0 position

; ----------	Register PCICR bits		------------------------
.equ	PCIE_MASK	= 0x07		;      - Pin Change Interrupt Enables (3 bits)
.equ	PCIE0		= 0		;          PCIE BIT0 position



; ====	ADC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register ADMUX bits		------------------------
.equ	REFS_MASK	= 0xC0		;      - Reference Selection Bits (2 bits)
.equ	REFS0		= 6		;          REFS BIT0 position
.equ	ADLAR		= 5		; 0x20 - ADC Left Adjust Result
.equ	MUX_MASK	= 0x1F		;      - Analog Channel and Gain Selection Bits (5 bits)
.equ	MUX0		= 0		;          MUX BIT0 position
; ::::  REFS	:::: bitfield values
;			0x00		; AREF, Internal reference voltage generation turned off
;			0x40		; AVDD with external capacitor at AREF pin
;			0x80		; Internal 1.5V Voltage Reference (no external capacitor at AREF pin)
;			0xC0		; Internal 1.6V Voltage Reference (no external capacitor at AREF pin)

; ----------	Register ADCSRA bits		------------------------
.equ	ADEN		= 7		; 0x80 - ADC Enable
.equ	ADSC		= 6		; 0x40 - ADC Start Conversion
.equ	ADATE		= 5		; 0x20 - ADC Auto Trigger Enable
.equ	ADIF		= 4		; 0x10 - ADC Interrupt Flag
.equ	ADIE		= 3		; 0x08 - ADC Interrupt Enable
.equ	ADPS_MASK	= 0x07		;      - ADC  Prescaler Select Bits (3 bits)
.equ	ADPS0		= 0		;          ADPS BIT0 position
; ::::  ADPS	:::: bitfield values
;			0x00		; 2
;			0x01		; 2
;			0x02		; 4
;			0x03		; 8
;			0x04		; 16
;			0x05		; 32
;			0x06		; 64
;			0x07		; 128

; ----------	Register ADCSRB bits		------------------------
.equ	AVDDOK		= 7		; 0x80 - AVDD Supply Voltage OK
;.equ	ACME		= 6		; 0x40 - Analog Comparator Multiplexer Enable
.equ	REFOK		= 5		; 0x20 - Reference Voltage OK
.equ	ACCH		= 4		; 0x10 - Analog Channel Change
.equ	MUX5		= 3		; 0x08 - Analog Channel and Gain Selection Bits
.equ	ADTS_MASK	= 0x07		;      - ADC Auto Trigger Source (3 bits)
.equ	ADTS0		= 0		;          ADTS BIT0 position
; ::::  ADTS	:::: bitfield values
;			0x00		; Free Running mode
;			0x01		; Analog Comparator
;			0x02		; External Interrupt Request 0
;			0x03		; Timer/Counter0 Compare Match A
;			0x04		; Timer/Counter0 Overflow
;			0x05		; Timer/Counter1 Compare Match B
;			0x06		; Timer/Counter1 Overflow
;			0x07		; Timer/Counter1 Capture Event

