sterentev/atdf-device-asm-include/inc/ATmega64RFR2.inc
; ----------	Register ADCSRC bits		------------------------
.equ	ADTHT_MASK	= 0xC0		;      - ADC Track-and-Hold Time (2 bits)
.equ	ADTHT0		= 6		;          ADTHT BIT0 position
.equ	ADCSRC_Res0	= 5		; 0x20 - Reserved
.equ	ADSUT_MASK	= 0x1F		;      - ADC Start-up Time (5 bits)
.equ	ADSUT0		= 0		;          ADSUT BIT0 position
; ::::  ADTHT	:::: bitfield values
;			0x00		; Single ended: 1, differential 3 ADC clock cycles
;			0x40		; Single ended: 2, differential 5 ADC clock cycles
;			0x80		; Single ended: 3, differential 7 ADC clock cycles
;			0xC0		; Single ended: 4, differential 9 ADC clock cycles
; ::::  ADSUT	:::: bitfield values
;			0x00		; 3 ADC clock cycles
;			0x01		; 7 ADC clock cycles
;			0x02		; 11 ADC clock cycles
;			0x03		; 15 ADC clock cycles
;			0x04		; ...
;			0x1E		; 251 ADC clock cycles
;			0x1F		; 255 ADC clock cycles

; ----------	Register DIDR2 bits		------------------------
.equ	ADC15D		= 7		; 0x80 - Reserved Bits
.equ	ADC14D		= 6		; 0x40 - Reserved Bits
.equ	ADC13D		= 5		; 0x20 - Reserved Bits
.equ	ADC12D		= 4		; 0x10 - Reserved Bits
.equ	ADC11D		= 3		; 0x08 - Reserved Bits
.equ	ADC10D		= 2		; 0x04 - Reserved Bits
.equ	ADC9D		= 1		; 0x02 - Reserved Bits
.equ	ADC8D		= 0		; 0x01 - Reserved Bits

; ----------	Register DIDR0 bits		------------------------
.equ	ADC7D		= 7		; 0x80 - Disable ADC7:0 Digital Input
.equ	ADC6D		= 6		; 0x40 - Disable ADC7:0 Digital Input
.equ	ADC5D		= 5		; 0x20 - Disable ADC7:0 Digital Input
.equ	ADC4D		= 4		; 0x10 - Disable ADC7:0 Digital Input
.equ	ADC3D		= 3		; 0x08 - Disable ADC7:0 Digital Input
.equ	ADC2D		= 2		; 0x04 - Disable ADC7:0 Digital Input
.equ	ADC1D		= 1		; 0x02 - Disable ADC7:0 Digital Input
.equ	ADC0D		= 0		; 0x01 - Disable ADC7:0 Digital Input



; ====	BOOT_LOAD MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register SPMCSR bits		------------------------
.equ	SPMIE		= 7		; 0x80 - SPM Interrupt Enable
.equ	RWWSB		= 6		; 0x40 - Read While Write Section Busy
.equ	SIGRD		= 5		; 0x20 - Signature Row Read
.equ	RWWSRE		= 4		; 0x10 - Read While Write Section Read Enable
.equ	BLBSET		= 3		; 0x08 - Boot Lock Bit Set
.equ	PGWRT		= 2		; 0x04 - Page Write
.equ	PGERS		= 1		; 0x02 - Page Erase
.equ	SPMEN		= 0		; 0x01 - Store Program Memory Enable



; ====	CPU MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SREG bits		------------------------
.equ	SREG_I		= 7		; 0x80 - Global Interrupt Enable
.equ	SREG_T		= 6		; 0x40 - Bit Copy Storage
.equ	SREG_H		= 5		; 0x20 - Half Carry Flag
.equ	SREG_S		= 4		; 0x10 - Sign Bit
.equ	SREG_V		= 3		; 0x08 - Two's Complement Overflow Flag
.equ	SREG_N		= 2		; 0x04 - Negative Flag
.equ	SREG_Z		= 1		; 0x02 - Zero Flag
.equ	SREG_C		= 0		; 0x01 - Carry Flag

; ----------	Register MCUCR bits		------------------------
;.equ	JTD		= 7		; 0x80 - JTAG Interface Disable
.equ	PUD		= 4		; 0x10 - Pull-up Disable
.equ	IVSEL		= 1		; 0x02 - Interrupt Vector Select
.equ	IVCE		= 0		; 0x01 - Interrupt Vector Change Enable

; ----------	Register MCUSR bits		------------------------
;.equ	JTRF		= 4		; 0x10 - JTAG Reset Flag
.equ	WDRF		= 3		; 0x08 - Watchdog Reset Flag
.equ	BORF		= 2		; 0x04 - Brown-out Reset Flag
.equ	EXTRF		= 1		; 0x02 - External Reset Flag
.equ	PORF		= 0		; 0x01 - Power-on Reset Flag

; ----------	Register OSCCAL bits		------------------------
.equ	CAL_MASK	= 0xFF		;      - Oscillator Calibration Tuning Value (8 bits)
.equ	CAL0		= 0		;          CAL BIT0 position
.equ	OSCCAL_MASK	= 0xFF		;      - Oscillator Calibration  (8 bits)
.equ	OSCCAL0		= 0		;          OSCCAL BIT0 position
; ::::  CAL	:::: bitfield values
;			0x00		; Calibration value for lowest oscillator frequency
;			0x7F		; End value of low frequency range calibration
;			0x80		; Start value of high frequency range calibration
;			0xFF		; Calibration value for highest oscillator frequency

; ----------	Register CLKPR bits		------------------------
.equ	CLKPCE		= 7		; 0x80 - Clock Prescaler Change Enable
.equ	CLKPS_MASK	= 0x0F		;      - Clock Prescaler Select Bits (4 bits)
.equ	CLKPS0		= 0		;          CLKPS BIT0 position
; ::::  CLKPS	:::: bitfield values
;			0x00		; Division factor 1   / RC-Oscillator   2
;			0x01		; Division factor 2   / RC-Oscillator   4
;			0x02		; Division factor 4   / RC-Oscillator   8
;			0x03		; Division factor 8   / RC-Oscillator  16
;			0x04		; Division factor 16  / RC-Oscillator  32
;			0x05		; Division factor 32  / RC-Oscillator  64
;			0x06		; Division factor 64  / RC-Oscillator 128
;			0x07		; Division factor 128 / RC-Oscillator 256
;			0x08		; Division factor 256 / RC-Oscillator 512
;			0x09		; Reserved
;			0x0A		; Reserved
;			0x0B		; Reserved
;			0x0C		; Reserved
;			0x0D		; Reserved
;			0x0E		; Reserved
;			0x0F		; Division factor 1 only permitted for RC-Oscillator. Flash and EEPROM programming is not allowed.

; ----------	Register SMCR bits		------------------------
.equ	SM_MASK		= 0x0E		;      - Sleep Mode Select bits (3 bits)
.equ	SM0		= 1		;          SM BIT0 position
.equ	SE		= 0		; 0x01 - Sleep Enable
; ::::  SM	:::: bitfield values
;			0x00		; Idle
;			0x02		; ADC Noise Reduction (If Available)
;			0x04		; Power Down
;			0x06		; Power Save
;			0x08		; Reserved
;			0x0A		; Reserved
;			0x0C		; Standby
;			0x0E		; Extended Standby

; ----------	Register GPIOR2 bits		------------------------
.equ	GPIOR_MASK	= 0xFF		;      - General Purpose I/O Register 2 Value (8 bits)
;.equ	GPIOR0		= 0		;          GPIOR BIT0 position

; ----------	Register GPIOR1 bits		------------------------
;.equ	GPIOR_MASK	= 0xFF		;      - General Purpose I/O Register 1 Value (8 bits)
;.equ	GPIOR0		= 0		;          GPIOR BIT0 position

; ----------	Register GPIOR0 bits		------------------------
.equ	GPIOR07		= 7		; 0x80 - General Purpose I/O Register 0 Value
.equ	GPIOR06		= 6		; 0x40 - General Purpose I/O Register 0 Value
.equ	GPIOR05		= 5		; 0x20 - General Purpose I/O Register 0 Value
.equ	GPIOR04		= 4		; 0x10 - General Purpose I/O Register 0 Value
.equ	GPIOR03		= 3		; 0x08 - General Purpose I/O Register 0 Value
.equ	GPIOR02		= 2		; 0x04 - General Purpose I/O Register 0 Value
.equ	GPIOR01		= 1		; 0x02 - General Purpose I/O Register 0 Value
.equ	GPIOR00		= 0		; 0x01 - General Purpose I/O Register 0 Value

